Revit 2027 API
Camera Constructor
 Camera
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Camera(
	Camera other
)
Public Sub New (
	other As Camera
)
public:
Camera(
	Camera^ other
)
new :
        other : Camera -> Camera
Parameters
other Camera
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace